In [1]:
# imports the packages

import pandas as pd
import numpy as np
from pandas import DataFrame

In [7]:
# sets up some dummy data

df1 = pd.DataFrame({'year': ['2014','2014','2014','2014','2015','2014'],
                    'month': ['Jan','Jan','Mar','Apr','Jun','Jul'],
                    'animal': ['cat','cat','cat','goat','cat','goat']
                    })

df1

  animal month  year
0    cat   Jan  2014
1    cat   Jan  2014
2    cat   Mar  2014
3   goat   Apr  2014
4    cat   Jun  2015
5   goat   Jul  2014

In [8]:
# Step 1
# add a dummy column so the counts will tabulate in later steps; note, the only way to get a groupby count is through this step

df1['count'] = 0

df1

  animal month  year  count
0    cat   Jan  2014      0
1    cat   Jan  2014      0
2    cat   Mar  2014      0
3   goat   Apr  2014      0
4    cat   Jun  2015      0
5   goat   Jul  2014      0

In [9]:
# Step 2
# set up a grouping so we can flatten our table and summarize the groupings

grouped = df1.groupby(['year','month','animal'])

# use the count aggregator and then reset the index to get it back to a pretty dataframe
df_new_grouped = grouped.count().reset_index()

df_new_grouped

   year month animal  count
0  2014   Apr   goat      1
1  2014   Jan    cat      2
2  2014   Jul   goat      1
3  2014   Mar    cat      1
4  2015   Jun    cat      1

In [12]:
# Step 3
# Now to get the average of the count!!!!!

# similiar to before, we set up the grouping; in this example, I want the average number of animals by year
grouped2 = df_new_grouped.groupby(['year','animal'])

df_newest_grouped = grouped2.mean().reset_index()

# rename the 'count' column to 'average'
df_newest_grouped = df_newest_grouped.rename(columns = {'count':'average'})

# voila! This pro
df_newest_grouped

   year animal  average
0  2014    cat      1.5
1  2014   goat      1.0
2  2015    cat      1.0

In [ ]:
# for some other advanced counting options:

#http://stackoverflow.com/questions/31649669/pandas-groupby-count-string-occurrence-over-column